Revit 2026 API

# RebarBendDataBendRadius Property

---

The radius of all fillets, except hook fillets, in the Rebar shape. The default value is 0.0.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double BendRadius { get; set; }
```
```vb
Public Property BendRadius As Double
	Get
	Set
```
```cpp
public:
property double BendRadius {
	double get ();
	void set (double value);
}
```
```fsharp
member BendRadius : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for bendRadius is not finite |

Inner radius, not centerline

#### Reference

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace